---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Inequality(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/69937be2-d520-883b-1c87-b475ca9067c8.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Inequality Method

Determines whether two IFCAnyHandles are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	IFCAnyHandle first,
	IFCAnyHandle second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The first IFCAnyHandle.
- **second** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The second IFCAnyHandle.

## Returns
True if the IFCAnyHandles are different; otherwise, false.